#+TITLE: dotfiles

My personal dotfiles

#+TOC: headlines

* First time setup

Run this in the terminal. It will setup homebrew and emacs and run [[tldr]] for you.

#+begin_src shell
  ./init.sh
#+end_src

* Usage

** TL;DR

#+Name: tldr
#+begin_src shell :noweb yes
  <<install-deps>>
  <<symlink>>
#+end_src


** Dependencies

I didn't need tap for now. But I will keep it as a reference:

    kde-mac/kde https://invent.kde.org/packaging/homebrew-kde.git

#+Name: brew-taps
#+begin_src elisp
  (quote
   (;; borkdude/brew
    ;; bufbuild/buf
    ;; d12frosted/emacs-plus
    ;; homebrew/cask-fonts
    ;; homebrew/cask-versions
    ;; homebrew/command-not-found
    mkhoeini/tap ; fortune-mod
    oven-sh/bun ; bun.sh
    ;; remotemobprogramming/brew
    ;; spotify/public
    ;; tnk-studio/tools ; lazykube
    ))
#+end_src

#+Name: brew-formulas
#+begin_src elisp
  (quote
   (;; adns
    antigen ; ZSH plugin management. TODO replace with antidote
    ;; aom
    ;; asciinema
    asdf ; tools version management
    ;; assimp
    ;; autoconf
    ;; automake
    ;; awk
    ;; babashka
    bat ; better cat alternative
    ;; bdw-gc
    ;; berkeley-db
    ;; bison
    ;; black
    ;; boost
    bottom ; better top util
    ;; brotli
    bun ; node.js alternative
    ;; burklee
    ;; bzip2
    ;; c-ares
    ;; ca-certificates
    ;; cairo
    ;; cjson
    ;; clojure
    ;; clojurescript
    ;; cmake
    ;; cmocka
    ;; concurrencykit
    ;; coreutils
    cowsay ; terminal eye candy
    ;; ctags
    ;; curlie
    ;; dav1d
    ;; dbus
    ;; deno
    ;; desktop-file-utils
    ;; direnv
    ;; docbook
    ;; docbook-xsl
    ;; double-conversion
    ;; doxygen
    ;; dust
    ;; ebook-tools
    ;; edencommon
    ;; emacs-plus@29
    ;; entr
    exa ; another ls alternative. TODO compare with lsd and choose one
    ;; exiv2
    ;; extra-cmake-modules
    ;; fasd
    ;; fb303
    ;; fbthrift
    fd ; better find util
    ;; ffmpeg
    ;; fizz
    ;; flac
    ;; flex
    ;; flyway
    ;; fmt
    ;; folly
    ;; fontconfig
    fortune-mod ; beautiful quotes in the terminal. TODO include more quotes
    ;; freetype
    ;; frei0r
    ;; fribidi
    ;; fx
    fzf ; fuzzy search util
    ;; fzy
    ;; gcc
    ;; gd
    ;; gdbm
    ;; gdk-pixbuf
    ;; gettext
    ;; gflags
    ;; gh
    ;; ghc
    ;; ghostscript
    ;; giflib
    git ; version control system
    ;; git-delta
    ;; git-gui
    ;; glib
    ;; glog
    ;; gmp
    ;; gnu-getopt
    gnu-sed ; standard sed util implementation
    ;; gnu-tar
    ;; gnupg
    ;; gnutls
    ;; go
    ;; gobject-introspection
    ;; gperf
    ;; gpgme
    ;; graphite2
    ;; graphviz
    ;; grpcurl
    ;; gts
    ;; guile
    ;; hades-cli
    ;; harfbuzz
    ;; highway
    ;; hmtools
    ;; httpie
    ;; hub
    ;; hunspell
    hyperfine ; terminal benchmark util
    ;; icu4c
    ;; ijq
    ;; ilmbase
    ;; imagemagick
    ;; imath
    ;; ipython
    ;; isl
    ;; ispell
    ;; jansson
    ;; jasper
    ;; jbig2dec
    ;; jemalloc
    ;; jet
    ;; jid
    ;; jlog
    ;; jpeg
    ;; jpeg-turbo
    ;; jpeg-xl
    ;; jq
    just ; better make alternative
    ;; k6
    ;; kde-extra-cmake-modules
    ;; kf5-kdoctools
    ;; krb5
    ;; kubectl-site
    ;; kubectx
    ;; kubernetes-cli
    ;; lame
    lazygit ; git TUI
    ;; lazykube
    ;; leiningen
    ;; leptonica
    ;; libarchive
    ;; libass
    ;; libassuan
    ;; libavif
    ;; libb2
    ;; libbluray
    ;; libcanberra
    ;; libcbor
    ;; libcroco
    ;; libde265
    ;; libepoxy
    ;; libev
    ;; libevent
    ;; libffi
    ;; libfido2
    ;; libgccjit
    ;; libgcrypt
    ;; libgpg-error
    ;; libheif
    ;; libidn
    ;; libidn2
    ;; libksba
    ;; liblinear
    ;; liblqr
    ;; libmng
    ;; libmpc
    ;; libmtp
    ;; libnghttp2
    ;; libogg
    ;; libomp
    ;; libpng
    ;; libproxy
    ;; libpthread-stubs
    ;; libraw
    ;; librist
    ;; librsvg
    ;; libsamplerate
    ;; libsndfile
    ;; libsodium
    ;; libsoxr
    ;; libssh
    ;; libssh2
    ;; libtasn1
    ;; libtermkey
    ;; libtiff
    ;; libtool
    ;; libunistring
    ;; libusb
    ;; libusb-compat
    ;; libuv
    ;; libvidstab
    ;; libvmaf
    ;; libvorbis
    ;; libvpx
    ;; libvterm
    ;; libx11
    ;; libxau
    ;; libxcb
    ;; libxdmcp
    ;; libxext
    ;; libxml2
    ;; libxrender
    ;; libxslt
    ;; libyaml
    ;; libzip
    ;; little-cms2
    ;; llvm
    lolcat ; make terminal quotes colorful
    lsd ; better ls alternative
    ;; lua
    ;; lua@5.3
    ;; luajit
    ;; luajit-openresty
    ;; luarocks
    ;; luv
    ;; lz4
    ;; lzo
    ;; m4
    ;; make
    ;; maven
    ;; mbedtls
    ;; md4c
    ;; mitmproxy
    ;; mob
    ;; mosh
    ;; mpdecimal
    ;; mpfr
    ;; msgpack
    ;; mysql
    ;; ncurses
    neovide ; GUI for neovim
    neovim ; better vim alternative
    ;; netpbm
    ;; nettle
    ;; nghttp2
    ;; ninja
    ;; nmap
    ;; node@16
    ;; npth
    ;; nspr
    ;; nss
    ;; oha
    ;; onefetch
    ;; oniguruma
    ;; opencore-amr
    ;; openexr
    ;; openjdk
    ;; openjdk@11
    ;; openjpeg
    ;; openslp
    ;; openssl@1.1
    ;; opus
    ;; p11-kit
    ;; pandoc
    ;; pango
    ;; parallel
    ;; pcre
    ;; pcre2
    ;; perl
    ;; pgweb
    ;; pinentry
    ;; pixman
    ;; pkg-config
    ponysay ; cowsay alternative
    ;; poppler
    ;; postgresql
    ;; postgresql@13
    ;; postgresql@14
    ;; prettyping
    procs ; better ps alternative
    ;; protobuf
    ;; pygments
    ;; python@3.10
    ;; python@3.8
    ;; python@3.9
    ;; qt
    ;; qt@5
    ranger ; terminal file manager
    ;; rav1e
    ;; readline
    ;; recode
    ;; ripgrep
    ;; rlwrap
    ;; rtmpdump
    ;; rubberband
    ;; rust
    ;; sbt
    ;; scala
    ;; scc
    ;; scio
    ;; sdl2
    ;; shared-mime-info
    ;; shellcheck
    ;; showkey
    ;; six
    sk ; like fzf. TODO compare with fzf and choose one
    ;; snappy
    ;; speedtest-cli
    ;; speex
    ;; spgrpcurl
    ;; spotify-disco
    ;; spotify-nameless-cli
    ;; sqlite
    ;; srt
    starship ; zsh prompt
    stow ; symlink management
    ;; styx-cli
    ;; taglib
    ;; tcl-tk
    ;; tesseract
    ;; texinfo
    ;; theora
    ;; tmux
    ;; tree-sitter
    ;; ttyplot
    ;; unbound
    ;; unibilium
    ;; unixodbc
    ;; utf8proc
    ;; v2ray
    ;; wakatime-cli
    ;; wangle
    watchexec ; run commands on file change
    ;; watchman
    ;; webp
    ;; websocat
    ;; wget
    ;; x264
    ;; x265
    ;; xmlto
    ;; xorgproto
    ;; xvid
    ;; xz
    ;; z
    ;; z3
    zellij ; better tmux alternative
    ;; zeromq
    ;; zimg
    ;; zlib
    zoxide ; better cd alternative. z command
    ;; zsh
    ;; zstd
    ))
#+end_src

#+Name: brew-casks
#+begin_src elisp
  (quote
   (;; alacritty
    ;; browserosaurus
    ;; chromium
    ;; coconutbattery
    ;; corretto
    ;; corretto8
    ;; edex-ui
    ;; emacsclient
    ;; firefox
    ;; font-code-new-roman-nerd-font
    ;; font-dejavu-sans-mono-nerd-font
    ;; font-droidsansmono-nerd-font
    ;; font-fira-code-nerd-font
    ;; font-firacode-nerd-font
    ;; font-hack-nerd-font
    ;; font-hasklig
    ;; font-hasklig-nerd-font
    ;; font-iosevka-nerd-font
    ;; font-jetbrains-mono-nerd-font
    ;; font-juliamono
    ;; font-lilex
    ;; font-monoid-nerd-font
    ;; font-noto-nerd-font
    ;; font-robotomono-nerd-font
    ;; font-victor-mono-nerd-font
    ;; github-beta
    ;; google-chrome
    google-cloud-sdk ; cli for google cloud
    ;; hammerspoon
    ;; iina
    ;; intellij-idea-ce
    ;; kitty
    ;; lapce
    ;; meetingbar
    ;; noisebuddy
    ;; noisy
    ;; oracle-jdk
    ;; pgadmin4
    ;; pycharm
    ;; qutebrowser
    ;; rectangle
    ;; retinizer
    ;; slack
    ;; spectacle
    ;; spotify
    ;; swiftdefaultappsprefpane
    ;; telegram
    ;; telegram-desktop
    ;; todoist
    ;; tomatobar
    ;; vimr
    ;; virtualbox
    ;; virtualbox-extension-pack
    ;; visual-studio-code
    ;; vlc
    ;; webstorm
    ;; xbar
    ))
#+end_src

#+Name: install-deps
#+begin_src elisp :results value verbatim :var formula-list=brew-formulas cask-list=brew-casks tap-list=brew-taps
  (let* ((installed-formulas (shell-command-to-string "brew list --formula"))
         (installed-casks (shell-command-to-string "brew list --cask"))
         (installed-taps (shell-command-to-string "brew tap"))
         (tap-out (mapconcat (lambda (tap)
                               (if (not (string-match-p (format "%s" tap) installed-taps))
                                   (shell-command-to-string (format "brew tap '%s'" tap))
                                 ""))
                             tap-list))
         (formula-out (mapconcat (lambda (formula)
                                   (if (not (string-match-p (format "%s" formula) installed-formulas))
                                       (shell-command-to-string (format "brew install '%s'" formula))
                                     ""))
                                 formula-list))
         (cask-out (mapconcat (lambda (cask)
                                (if (not (string-match-p (format "%s" cask) installed-casks))
                                    (shell-command-to-string (format "brew install --cask '%s'" cask))
                                  ""))
                              cask-list)))
    (concat formula-out cask-out))
#+end_src

#+RESULTS:
: ""


** Link files

#+Name: symlink
#+begin_src shell
  stow -t $HOME home_links
#+end_src

#+RESULTS: symlink
